02_Modelagem_UML_Astah/UC08_Consultar_Agente_IA/UC08_Sequencia.puml
@startuml
skinparam monochrome true
autonumber
participant A as ":Aluno"
participant IA as ":AgenteIA"
A -> IA : enviarDuvida(texto)
IA -> IA : processarLinguagem()
IA --/ A : Resposta
@enduml
